Repository: farahh212/Nashra-App
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Emergency Numbers
ar: أرقام الطوارئ

source: Manage Emergency Numbers
ar: إدارة أرقام الطوارئ

source: Add Emergency Number
ar: إضافة رقم طوارئ

source: Edit Emergency Number
ar: تعديل رقم الطوارئ

# title
source: Title (e.g., Police, Ambulance)
ar: العنوان (مثال: الشرطة، الإسعاف)

source: Emergency Number
ar: رقم الطوارئ

source: Cancel
ar: إلغاء

source: Add
ar: إضافة

source: Update
ar: تحديث

source: Delete
ar: حذف

# pleaseFillAllFields
source: Please fill in all fields
ar: يرجى ملء جميع الحقول

# pleaseEnterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح

# emergencyNumberAdded
source: Emergency number added successfully
ar: تمت إضافة رقم الطوارئ بنجاح

# emergencyNumberUpdated
source: Emergency number updated successfully
ar: تم تحديث رقم الطوارئ بنجاح

# emergencyNumberDeleted
source: Emergency number deleted successfully
ar: تم حذف رقم الطوارئ بنجاح

# errorAddingContact
source: Error adding contact: {error}
ar: خطأ في إضافة جهة الاتصال: {error}

# errorUpdatingContact
source: Error updating contact: {error}
ar: خطأ في تحديث جهة الاتصال: {error}

# errorDeletingContact
source: Error deleting contact: {error}
ar: خطأ في حذف جهة الاتصال: {error}

# noEmergencyNumbers
source: No emergency numbers found
ar: لم يتم العثور على أرقام طوارئ
